OSCCAR/utilities/multiphase/twoPhaseEulerFoam/RAS/DeenSquareBubbleColumn/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.075 -0.075 0  ) // 0
    ( 0.075 -0.075 0  ) // 1
    ( 0.075  0.075 0  ) // 2
    (-0.075  0.075 0  ) // 3
    (-0.075 -0.075 0.6) // 4
    ( 0.075 -0.075 0.6) // 5
    ( 0.075  0.075 0.6) // 6
    (-0.075  0.075 0.6) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (15 15 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (0 4 7 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
