OSCCAR/utilities/multiphase/twoPhaseEulerFoam/RAS/DeenSquareBubbleColumn/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          9;
        startFace       38475;
    }
    outlet
    {
        type            patch;
        nFaces          225;
        startFace       38484;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          216;
        startFace       38709;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3600;
        startFace       38925;
    }
)

// ************************************************************************* //
