OSCCAR/utilities/multiphase/twoPhaseEulerFoam/RAS/DeenSquareBubbleColumn/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    sampleLine
    {
        type    uniform;
        axis    distance;
        start   ( -0.075 0 0.25 );
        end     ( 0.075 0 0.25 );
        nPoints 100;
    }
);

fields
(
    U.water
);


// ************************************************************************* //
